; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city1)
	(fuel-level plane1 fl3)
	(at plane2 city3)
	(fuel-level plane2 fl0)
	(at plane3 city8)
	(fuel-level plane3 fl2)
	(at plane4 city0)
	(fuel-level plane4 fl1)
	(at plane5 city8)
	(fuel-level plane5 fl2)
	(at plane6 city3)
	(fuel-level plane6 fl2)
	(at plane7 city6)
	(fuel-level plane7 fl3)
	(at person1 city6)
	(at person2 city3)
	(at person3 city5)
	(at person4 city0)
	(at person5 city2)
	(at person6 city5)
	(at person7 city8)
	(at person8 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city5)
	(at plane4 city5)
	(at person1 city8)
	(at person2 city0)
	(at person3 city0)
	(at person4 city8)
	(at person5 city4)
	(at person6 city0)
	(at person7 city0)
	(at person8 city7)
	))

)

; plan
1. (board person1 plane7 city6)
   deleted: (at person1 city6)
   added: (in person1 plane7)
   goals met: 0 of 10
2. (zoom plane7 city6 city8 fl3 fl2 fl1)
   deleted: (at plane7 city6) (fuel-level plane7 fl3)
   added: (at plane7 city8) (fuel-level plane7 fl1)
   goals met: 0 of 10
3. (debark person1 plane7 city8)
   deleted: (in person1 plane7)
   added: (at person1 city8)
   goals met: 1 of 10
4. (board person2 plane6 city3)
   deleted: (at person2 city3)
   added: (in person2 plane6)
   goals met: 1 of 10
5. (zoom plane6 city3 city0 fl2 fl1 fl0)
   deleted: (at plane6 city3) (fuel-level plane6 fl2)
   added: (at plane6 city0) (fuel-level plane6 fl0)
   goals met: 1 of 10
6. (debark person2 plane6 city0)
   deleted: (in person2 plane6)
   added: (at person2 city0)
   goals met: 2 of 10
7. (board person4 plane4 city0)
   deleted: (at person4 city0)
   added: (in person4 plane4)
   goals met: 2 of 10
8. (board person7 plane3 city8)
   deleted: (at person7 city8)
   added: (in person7 plane3)
   goals met: 2 of 10
9. (zoom plane3 city8 city0 fl2 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl2)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 2 of 10
10. (debark person7 plane3 city0)
   deleted: (in person7 plane3)
   added: (at person7 city0)
   goals met: 3 of 10
11. (zoom plane1 city1 city5 fl3 fl2 fl1)
   deleted: (at plane1 city1) (fuel-level plane1 fl3)
   added: (at plane1 city5) (fuel-level plane1 fl1)
   goals met: 4 of 10
12. (board person6 plane1 city5)
   deleted: (at person6 city5)
   added: (in person6 plane1)
   goals met: 4 of 10
13. (board person3 plane1 city5)
   deleted: (at person3 city5)
   added: (in person3 plane1)
   goals met: 4 of 10
14. (fly plane4 city0 city5 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 5 of 10
15. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 10
16. (zoom plane5 city8 city1 fl2 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl2)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 5 of 10
17. (board person8 plane5 city1)
   deleted: (at person8 city1)
   added: (in person8 plane5)
   goals met: 5 of 10
18. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 5 of 10
19. (fly plane5 city1 city7 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 5 of 10
20. (debark person8 plane5 city7)
   deleted: (in person8 plane5)
   added: (at person8 city7)
   goals met: 6 of 10
21. (fly plane7 city8 city2 fl1 fl0)
   deleted: (at plane7 city8) (fuel-level plane7 fl1)
   added: (at plane7 city2) (fuel-level plane7 fl0)
   goals met: 6 of 10
22. (board person5 plane7 city2)
   deleted: (at person5 city2)
   added: (in person5 plane7)
   goals met: 6 of 10
23. (refuel plane7 city2 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 6 of 10
24. (fly plane7 city2 city4 fl1 fl0)
   deleted: (at plane7 city2) (fuel-level plane7 fl1)
   added: (at plane7 city4) (fuel-level plane7 fl0)
   goals met: 6 of 10
25. (debark person5 plane7 city4)
   deleted: (in person5 plane7)
   added: (at person5 city4)
   goals met: 7 of 10
26. (fly plane1 city5 city0 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 6 of 10
27. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 10
28. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   goals met: 7 of 10
29. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   goals met: 8 of 10
30. (fly plane1 city0 city5 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 9 of 10
31. (fly plane4 city5 city8 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 8 of 10
32. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 10
33. (debark person4 plane4 city8)
   deleted: (in person4 plane4)
   added: (at person4 city8)
   goals met: 9 of 10
34. (fly plane4 city8 city5 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 10 of 10
